[
{"abstractText": ["The present invention provides a hand-utility interface for use in protecting a user's hand during utility tasks and comprising a body having a plurality of finger-receiving channels defined therein, wherein the finger-receiving channels snugly receive the fingers of said user's hand such that in use, the finger-receiving channels secure the interface to the user's hand. Additional palm supports may be provided too if desired."]},
{"abstractText": ["This invention, titled “Thumb-eez”, are a cell phone accessory, and are designed to be worn while “texting”, or typing text messages. Thumb-eez are worn on the user's thumbs and permit more precise texting by reducing surface area at the point of contact; this is achieved through the utilization of projecting nibs, or styli, that correspond with the pressure points of the thumbs, thus enabling pinpoint accuracy. There are currently over a billion cell phone users worldwide, and the inventors hope to capitalize on this enormous market. The inventors hope that Thumb-eez will become the next hipster craze, such as Yoga-Toes or Head Blade, and are currently searching for an outside company to manufacture and distribute the Thumb-eez invention. Anyone interested in bringing this invention to market should contact the inventors at (256) 238-1524 or (334) 874-4135."]},
{"abstractText": ["A garment assembly includes a garment and a seat. The seat includes a front surface, a rear surface, a first side surface and a second side surface and defines an aperture that extends through the seat from the first side surface to the second side surface. The assembly further includes an at least partially elastic member including a first end section attached to the garment, a second end section attached to the garment, and an intermediate section extending through the seat aperture. At least one of the first end section and the second end section are elastic, and the intermediate section is elastic, such that the seat is deployable between a stowed position and a deployed position and exterior to the garment in the stowed and deployed position. The seat is configured to extend substantially vertical while stowed and substantially horizontal while deployed."]},
{"abstractText": ["Exemplary embodiments of a quick release garment can be provided. The exemplary garment can include a plurality of co-operable garment panels, which when interconnected, can form a garment in a condition wrapped about an upper torso of a person, a plurality releasable mechanical latches, each latch having a first and a second portion and at least one latch element biased towards an engaged condition, releasably engageable to interconnect the garment panels, and a release arrangement operable in a single operation to release the latches. Further, the latches can be structured so that the single operation allows the garment to fall from the upper torso, and the garment can thereafter be rapidly restorable to the condition wrapped about the upper torso by re-engaging each of the latches by pushing the first and second portions together against the bias to re-engage the latch element(s)."]},
{"abstractText": ["A glove with a coating layer of rubber containing air bubbles formed at least on the surface of a back portion of a glove base material made of fibers is provided, wherein the moisture permeability of the coating layer of the back portion ranges from 1000 to 9000 g/m·24 hrs in terms of a measured value according to JIS L 1099 A-1 method (calcium chloride method) and the wear loss of the coating layer of the back portion is 40 mg or less in terms of a value measured after 100 revolutions by use of a tester, Nu-Martindale Abrasion and Pilling Tester, specified by EN ISO 12947-1, according to the European Standard EN 388; 2003. The glove of the present invention is excellent in moisture permeability and abrasion resistance of a back portion."]},
{"abstractText": ["By adding a second smaller bill under the main bill of a baseball cap and creating a gap between the two bills, the upper bill creates a raised curve that acts like an airfoil and allows the free flow of air over a wearer's forehead, inducing a cooling effect. Besides the benefit of a cooling effect, the appearance of the hat is such that an observer looking at someone wearing it would not be able to tell there was anything overtly different about the design."]},
{"abstractText": ["A pair of trousers has two side seams, a front seam, a back seam, an inseam, an outer part, and an inner part. The outer part constitutes the trousers and is formed by sub-parts joined at the seams. The inner part is arranged along a front part of the outer part and is joined to the outer part at the side and front seams. The outer part is made from a first material and the inner part is made from a second material, the first material having a higher elasticity than the second material. The inner part includes at least two stitchings extending from a first side seam towards the front seam, and at least two stitchings extending from a second side seam towards the front seam which follow the shape of an abdomen of a person wearing the trousers to thereby support the abdomen."]},
{"abstractText": ["A helmet system that employs an outer shell and a unitary inner shell formed with compatible grooves and ridges respectively. The outer shell is formed with a switch. The outer shell and inner shell are further secured together via magnetic force or a system of springs and levers in conjunction with the switch that allows for a user of the helmet system to seamlessly remove the outer shell through either a set amount of breakaway force or by using the switch."]},
{"abstractText": ["Body protective clothing, comprising a hard shell () for covering the body part to be protected and an impact protection () arranged at the inside of the body protective clothing, the impact protection () comprising an impact absorbing foam enclosed by an airtight casing and at least one valve (′) arranged at the airtight casing, wherein the valve (′) is realized as a pressure relief valve in such a way that the compression of the impact protection () caused as a result of a crash opens the valve (′) for pressure reduction in the impact protection ()."]},
{"abstractText": ["An energy-absorbing pad structure includes an energy-absorbing pad that is encapsulated by a polymeric film. The polymeric film is sufficiently air-permeable to permit air to escape during rapid compression of the pad structure, such as from a high-speed dynamic impact, but nonetheless is water resistant under ordinary conditions. It is desirable that the polymeric film is made from an elastic polymer. The air-permeability can be provided from a series of perforations such that the film's elastic quality tends to contract the perforations thereby impeding the progress of water through them under normal conditions. The energy-absorbing pad can be a semi-rigid viscoelastic foam."]},
{"abstractText": ["A safety helmet designed to protect the head of motorcyclists/bicyclists, athletes, soldiers, law enforcement, and/or heavy machinery operators due to impact/trauma and to provide emergency removal after an accident. The safety helmet comprises a shell defined by a right portion and a left portion, an outer surface and inner surface, and a front section and rear section. An opening at the front section allows the user to see outside of the shell, and a face shield, attached at opposing sides of the opening by a hinge, covers a substantial portion of the user's face. A plurality of securing mechanisms extends between the right portion and the left portion and holds the right portion and left portions in a separable manner. A resilient protective layer includes a top surface and a bottom surface for contacting with the inner surface of the shell and to fit over the head of the passenger."]},
{"abstractText": ["A portable closet with a heater comprises a tub composed of a bottom sheet and a plurality of side sheets and forming a cavity for receiving urine and excrement of users; a cover detachably covering the tub, which cover includes a toilet seat provided with an aperture and a lid pivotably connected to the toilet seat, and at least two hooks are provided on a lower surface of the toilet seat; a receiving bag hung from the hooks for receiving the urine and excrement; a plastic bag covering the receiving bag; a supporting base provided within the tub for supporting the receiving bag and the plastic bag; a rod provided for supporting toilet tissues; a slit formed through the toilet seat and aligning with the rob to enable the toilet tissues to pass through; a heater provided in the toilet seat for heating the toilet seat when being turned on."]},
{"abstractText": ["A toilet plunger cleaning system wherein a toilet plunger is provided having a handle with an inner chamber and a plunger head. The handle chamber has a reciprocating cylinder filled with a cleaning fluid. A plurality of circumferentially spaced normally closed holes are provided in the handle communicating with holes in the cylinder. A lever on the exterior of the handle is activated to align the holes in the cylinder with the holes in the handle to release fluid about the lower portion of the handle and the plunger head to clean and/or sanitize the same."]},
{"abstractText": ["In one aspect of the present invention, a system for the transportation of liquid and solid waste incorporated into a floor of a building has a generally horizontal pipe with a first and second end. A motor is disposed at the first end and an auger is disposed in and along at least a portion of a length of the pipe and is in communication with the motor. The auger is adapted to the transport of liquid and solid waste along the at least a portion of the length of the pipe."]},
{"abstractText": ["A portable compact toilet enclosure includes a main frame having an interior portion, a side frame, and a hood portion. The side frame is slidably coupled to the main frame and configured such that in a closed configuration of the portable compact toilet enclosure, the side frame portion is substantially disposed within the interior portion of the main frame. In an open configuration, the side frame is positioned away from the main frame such that substantial portions of the side frame portion are disposed outside of the interior portion of the main frame. The hood portion is hingedly attached to the side frame and configured such that in the closed configuration the hood portion is substantially disposed within the interior portion of the main frame, and in the open configuration is rotated in an upright position and substantially disposed outside of the interior portion of the main frame."]},
{"abstractText": ["An apparatus for driving and supporting cradle includes a table base and a cradle movable on the table base. The cradle includes an intermediate cradle moveable relative to the table base and an upper cradle moveable relative to the intermediate cradle. The table base is coupled to the intermediate cradle using a first rack and gear structure, and the intermediate cradle is coupled to the upper cradle using a second rack and gear structure."]},
{"abstractText": ["An air mattress is provided. The air mattress may comprises: a top sheet and a bottom sheet, the top and bottom sheets being made of a flexible airtight material and being connected to form an airtight inflatable compartment; and at least one vertical connecting unit, being disposed within the compartment, wherein the vertical connecting units are attached to respective inner surfaces of the top and bottom sheets to form connecting areas. The air mattress may also comprise a side sheet and at least one horizontal connecting unit."]},
{"abstractText": ["A posture channel innerspring is described having a plurality of helical form coils interconnected in an array in which the coils are generally aligned in rows and columns, each of the coils having a generally cylindrical coil body formed by helical turns of wire with openings between each of the helical turns of wire, and first and second ends to the coil body also formed by the wire, each of the coil bodies being spaced apart in the array. At least one posture channel support is inserted into the innerspring in the space between the spaced apart coils. The posture channel support may, in one embodiment, have an H-shaped configuration with having upper and lower parallel lateral members and a transverse member that extends between and bisects the upper and lower lateral members. In another embodiment, the posture channel support may be substantially T-shaped having a lower lateral member, a vertical member which is perpendicular to and bisects the lower lateral member and a lateral extension which extends outward from one side of the vertical member. The posture channel inserts may be create or define zones or regions of the innerspring which have different support characteristics from other zones or regions. The posture channel inserts may also be placed around the border of the innerspring to provide increased stability in this area of a mattress assembly."]},
{"abstractText": ["A pliers that includes a first member and a second member pivotally coupled to the first member. The pliers includes a head, a handle, a first end defining a nose of the head portion, and a second end, opposite the first end, defined by the handle of the pliers. Ridges are disposed on the first and the second members adjacent the nose and together define a grip of the pliers. Sharp edges of the first and second members are adjacent the ridges and between the ridges and the second end of the pliers and together define a cutter of the pliers. An aperture extends through the first member adjacent a pivot and between the pivot and the second end of the pliers, and the threaded aperture and the second member define a threaded fastener cutter of the pliers."]},
{"abstractText": ["A bridge superstructure comprises a first aspect of the present invention, a bridge structure comprises a contact surface supported by a decking mounted on a superstructure. The superstructure includes a mounting for the decking. The decking comprises a panel composed of a fibre reinforced polymer composite, the panel comprising a plate having an upperside and an underside, a plurality of first and second beams, each beam having an upper face and a base face and side faces, the upper face of each beam being integral with the underside of the plate, a first beam having an aperture extending between the side faces, wherein a second beam extends through the aperture. The panel further comprises means for attachment to the superstructure and a layer of wear-resistant material on the upper side of the plate."]},
{"abstractText": ["A surface-cleaning machine with on-board operator, such as a floor washing-drying machine, a floor washing machine, a sweeper, a high-pressure cleaner, a vacuum cleaner, or similar machines including an operators compartment including a footboard that defines a first fixed reference surface, having adjacent to it at least one pedal to control the surface cleaning machine. The footboard includes at least one resting member defining a second resting surface, with the second resting surface being adjustable with respect to the first fixed reference surface."]},
{"abstractText": ["A brush for use with a rotating motor device comprises a collar and a brush-head. The collar has a first open end and a second securing end. The securing end of the collar has a polygonal opening adapted for securely mating with a corresponding polygonal rotating shaft of a rotating motor device, such that when second end of the collar is secured to the rotating shaft, rotation of the shaft causes corresponding rotation of the collar."]},
{"abstractText": ["A brush section for use with an electric toothbrush includes a relatively large brush head portion having a generally rectangular shape, although oblong, elliptical and other such shapes having a length to width aspect ration greater than 1 may be employed. The brush head portion is secured to a shaft portion of the brush section that may be configured to couple to a handle section. The handle section may include an electric drive including drive shaft, and the drive shaft may couple to the brush head via a coupling member positioned within the shaft portion. The electric drive may impart a rotary, oscillating rotary-oscillating or other suitable drive motion to the drive shaft that is, in turn, imparted upon the brush head by virtue of the coupling member."]},
{"abstractText": ["Embodiments of an automated camera cleaning system are provided. In one embodiment, the automated camera cleaning system includes an optical path, an optically-transmissive lens shield through which the optical path extends, a housing in which the optically-transmissive lens shield is at least partially disposed, and a motor coupled to the lens shield. When energized, the motor moves the optically-transmissive lens shield relative to the housing to vary the region of the optically-transmissive lens shield positioned in the optical path."]},
{"abstractText": ["The invention relates to a toothbrush, having a head and a handle, wherein the head is provided with bristles. So that the toothbrush can be used for squeezing toothpaste out of a squeezed-together toothpaste tube, the invention provides that a slit is cut into the handle, and is matched in its length to the width of a squeezed-out toothpaste tube, and in its width to the thickness of a squeezed-out toothpaste tube."]},
{"abstractText": ["A conductive weld brush () consists of a conductive receptacle (), a bundle of conductive fibres () which are anchored by their inner end within the conductive receptacle () and a slidable support sleeve () which has a first end portion () which receives the conductive receptacle () and a shaped second end portion () which surrounds and shapes the fibre bundle ()."]},
{"abstractText": ["The present application is directed toward a tool holder for a flexible tube that contains a composition used in connection with the tool. The tool holder has a frame adapted to be secured the sealed end of the and a tool portion having a tool such as a razor blade, a brush, a cosmetic scraper blade, a planar scraper blade, a massager head, sandpaper, polishing device, or sponge applicator head."]},
{"abstractText": ["The invention relates to a connecting device () for a wiper arm () and a wiper blade (). Said wiper blade comprises a first connecting part () on the wiper blade end and a second connecting part () on the wiper arm end, both parts being juxtaposed in the operational position and being connected to each other via a hinge element () so that they can be swiveled about a hinge axis. Securing means () are provided so that the first and second connecting part () engage with each other. The invention is characterized in that the first connecting part () has a recess () for accommodating the securing means () in which a longitudinal, shaped portion () is provided which is parallel to the hinge axis. The invention also relates to a flat bar wiper blade () which comprises a first connecting part () for fastening the flat bar wiper blade () to a wiper arm (). The connecting part () comprises a counter-hinge element () so that the flat bar wiper blade () can be connected to the wiper arm () so that it can be swiveled about a hinge axis. Said flat bar wiper blade is characterized in that a recess () for accommodating a securing means () is provided in which a longitudinal, shaped portion () is provided which is parallel to the hinge axis."]},
{"abstractText": ["A surface treating appliance includes a plurality of frusto-conical cyclones arranged in parallel. Each cyclone has a relatively wide, rigid frusto-conical portion and a relatively narrow, flexible frusto-conical portion connected to the relatively wide portion. The relatively wide portion includes at least one dirty air inlet, and the relatively narrow portion includes a dirt outlet. The relatively narrow portion vibrates during use of the appliance is dislodged dirt from the inner surface of the relatively narrow portion, the dislodged dirt being expelled from the dirt outlet."]},
{"abstractText": ["A surface cleaning apparatus comprises a floor cleaning unit having a surface cleaning head, an upright section having a handle, a cleaning unit removably mounted to the handle and an air flow conduit forming part of an air flow path from the surface cleaning head to the cleaning unit, wherein the flexible air flow conduit comprises a portable portion removably mounted to the surface cleaning apparatus and a rigid extension wand. Reconfiguring the surface cleaning apparatus components permits the use of the surface cleaning apparatus in various operating modes such as a first upright operating mode wherein the surface cleaning apparatus is operable with the cleaning unit mounted to the handle, and a second operating mode wherein the cleaning unit is carried by a user and is operable when removed from the handle."]},
{"abstractText": ["A fastener driving device includes a housing having an engine receiving portion and a handle portion. A reservoir is configured to receive a gas having a pressure greater than atmospheric pressure and is at least partially located in the handle portion. A dust blower is configured to allow gas in the reservoir to be selectively communicated to atmosphere through an outlet in the engine receiving portion of the housing. The dust blower includes a passageway extending from the reservoir to the outlet in the engine receiving portion, the passageway at least partially circumnavigating the cylinder of the drive engine, and an actuator configured to selectively open and close the passageway so that when the passageway is open, gas from the reservoir is communicated from the reservoir to the outlet, and when the passageway is closed, the gas from the reservoir is not communicated from the reservoir to the outlet."]},
{"abstractText": ["A vacuum cleaner () comprising a housing () being separated in at least a dust compartment () and a motor compartment (). The vacuum cleaner () also comprises a motor () located in the motor compartment () and an air guide () between the dust compartment () and the motor (). The motor () is suspended in the motor compartment () by a suspension system comprising at least one spring ()."]},
{"abstractText": ["A surface cleaning head comprising one or more lower open sided air flow passages is provided. One or both air flow passages may be a lower open sided air flow passage and may have a rib to prevent carpet of the like from blocking the air flow passage. One of the passages may be a deep cleaning slot."]},
{"abstractText": ["An apparatus and associated method for operating a portable light assembly. In accordance with some embodiments, a frame providing a bridge and defining a transport region and a deployment region is slidingly connected to a mast. An arm is further connected to the mast by a hinge while a light fixture is connected to the arm. In various embodiments, the light fixture is capable of transitioning from a deployed position where the mast engages the deployment region and a transport position where the mast and light fixture are disposed within the transport region."]},
{"abstractText": ["A hinge apparatus for a folder-type portable communication device, wherein a body portion and a folder portion can be coupled or separated by applying a force to a hinge cap or moving a hinge dummy laterally. The device includes a body portion and a folder portion coupled to the body portion to pivot around a hinge axis, and a center hinge arm provided in the body portion. First and second side hinge arms are provided in the folder portion, and a hinge cap is provided in the first side hinge is pushed with an external force. A hinge shaft is coupled with or separated from the first side hinge arm by retracting or protruding via pushing the hinge cap, and a hinge dummy provided in the center hinge arm is coupled with or separated from the second side hinge arm by moving laterally along the hinge axis."]},
{"abstractText": ["A safety cord release for a window covering has a top section, a middle section, and a bottom section from a top to a bottom thereof. The safety cord release has a right case and a left case combined with the right case. There are several pairs of couplers on the right case and the left case located at the top section, the middle section and the bottom section respectively for engagement to reduce a transverse force from cords and to separate the right case and the left case immediately to release the cords for safety."]},
{"abstractText": ["A grip () for gripping a wire (L) includes a body () comprising an upper jaw () extending laterally, a pivot section () depending from one end of the upper jaw (), and a sleeve section () depending from the other end of the upper jaw (), the sleeve section () including a slot () at one end; a pivotal link () pivotably secured to the pivot section (); a gripping seat () pivotably secured to the pivotal link () and comprising a jaw member () disposed below the upper jaw (); and a lever () inserted through the slot () and having one end pivotably secured to the pivotal link () and a ring () at the other end. The ring () is positioned at an angle θ with respect to a longitudinal center line () of the wire (L) passing through the upper jaw ()."]},
{"abstractText": ["A jewelry clasp including at least a first jewelry interfacer and a second jewelry interfacer capable of magnetically coupling together. The magnetic coupling of the first and second jewelry interfacers can be substantially easy to decouple by applying force substantially in a first direction, but substantially difficult to decouple by applying force that is not substantially in the first direction. Accordingly, the jewelry clasp can be capable of being decoupled by a user with substantial ease while remaining substantially difficult to decouple when not desired."]},
{"abstractText": ["A buckle  for use in securing cargo by means of a flexible cargo strap has at least one surface  against which the strap bears, in use. The surface  is abrasive, in one example. This is achieved by coating the surface in a grit material"]},
{"abstractText": ["A slide fastener with a separable bottom end stop according to the invention, includes: an insert member fixed to an end of one element row, and a pivot support member fixed to an end of the other element row. The insert member includes an insert plate portion fixed to the fastener tape, and a pivot shaft portion disposed on the insert plate portion. The pivot support member includes a box pin portion that extends from an end of the element row, a box portion of a nearly J shape, a protrusion that extends from the box pin portion, and a flat plate-like support portion that extends from the box portion. As a result, even if a separable bottom end stop receives lateral pulling force or pushing-up force in the coupling state of the element rows, it is possible to prevent the element rows from being decoupled."]},
{"abstractText": ["A fixing buckle comprising a base provided with a latching hook for attaching a retaining ring, and control means able to occupy a locking position and a releasing position to respectively secure and release the retaining ring on and from the latching hook. The control means comprise two locking elements independent from one another and each having a stop and a control button. The locking elements are formed by two levers pivotally mounted inside the cover, the stop being arranged at one of the ends of each lever and the control button at the other end thereof. Detachment of the ring is enabled on no load and when the buttons of the two levers are actuated simultaneously to the releasing position."]},
{"abstractText": ["A mechanism/device is provided for use with a container or vessel or other object and, more particularly, a device for use with a bottle to assist in securing such bottle to a belt, belt loop, strap, hook or other hanging device while not in use and further allowing the securing of objects such as keys and key rings, and further allowing addition of personalizing accessories to the subject device."]},
{"abstractText": ["A simple and inexpensive device for a reliable tie down tensioning which device enables the tie-down to be quickly and easily applied and the flexible element tensioned and just as quickly and easily removed."]},
{"abstractText": ["A space saving burial container that bores its own hole and efficiently guides the cut away receiving material up and out of the hole to inter a fully secured body in a permanently natural upright position."]},
{"abstractText": ["The application discloses novel internal structures of energy conditioners, assemblies of external structures of energy conditioners and mounting structure, and novel circuits including energy conditioners having A, B, and G master electrodes."]},
{"abstractText": ["A barrel support device supports a barrel rotationally about an axis of the barrel with the axis being arranged vertically and an opening of the barrel through which a plunger rod is inserted being directed upward. A chuck of a plunger rod support device holds the plunger rod in a first holding state in which the plunger rod is prevented from rotating about and sliding along its axis and inserts it into the barrel. Then, the chuck enters a second holding state in which the plunger rod is prevented from rotating about its axis but is not prevented from sliding along its axis. A load application device places a load acting downward on the plunger rod, and a rotation application device rotates the barrel in a direction in which the plunger rod is screwed into a gasket in the barrel."]},
{"abstractText": ["A hinge remover has a thick cylindrical base with a central opening and a flange, a hollow cylindrical wall upon a yoke, and two spaced apart shoulders upon the yoke. The shoulders receive a door pin. The wall receives a head upon a spring and has two diametrically opposed recesses for ball bearings. The central opening admits the head extending opposite the yoke. The central opening narrows and forms a chamber for a propellant. The base has a radial aperture that opens for an igniter that contacts the propellant. During assembly, the head compresses upon the spring against the yoke revealing the recesses to receive the ball bearings as the head eases inwardly. Upon combustion of the propellant, the head retreats towards the yoke, the ball bearings fall, and the yoke separates from the base."]},
{"abstractText": ["A removing tool used for removing a removable element from a shielding cover. The removing tool comprises a handle including a first end and a head protruding from the first end, a driving portion mounted on the head, and a pushing portion mounted on the head between the driving portion and the first end. The driving portion is for latching with the removable element; the pushing portion pushes the removable element away from the shielding cover until the removable element separates from the shielding cover."]},
{"abstractText": ["A method for capturing small metal particles within an oil filter can. The method uses a flexible belt incorporating a number of pockets. Magnets are contained within the pockets, with one magnet per pocket being preferable. The pockets are sealed so that the belt and magnets operate as a unified whole. The belt is wrapped around an oil filter and held in place via the attraction between the magnets and the metal oil filter can. No additional securing mechanism is needed. The belt may be wrapped around oil filters of various sizes with no need for any alterations."]},
{"abstractText": ["The present invention provides a low profile, compact, scalable concept end-effector for use in robotic handling applications. The end-effector acts as the interface between multi-degree-of-freedom (DOF) manipulator and its base (if applicable), as well as the tools it handles and is compatible with both large manipulator systems such as the Shuttle Remote Manipulator System (SRMS) and Space Station Remote Manipulator System (SSRMS) and smaller dexterous manipulators such as the Orbital Express Dexterous Manipulator System. An active/controlled component is attached to the roll joint(s) at one or both end(s) of the manipulator, with an entirely passive component attached to the structure/tools that the manipulator interfaces with. Interface engagement and mate operations are performed by way of the manipulator roll joint. Once mated, shear pins are extended to lock the mated assembly in place and achieve a high stiffness, zero free play mated interface."]},
{"abstractText": ["A climbing apparatus that rests on a surface includes a flip ladder that can move between a straight configuration and a stepladder configuration. The apparatus includes a tray having a plane attached to the flip ladder that moves with the flip ladder between the straight configuration where the tray plane is essentially parallel with the ladder in a stowed position and a stepladder configuration where the tray plane is essentially parallel with the surface in an open position. A method for climbing includes the steps of moving a flip ladder between a straight configuration and a stepladder configuration. There is the step of moving a tray having a plane attached to the flip ladder from a stowed position where the tray plane is essentially parallel with the ladder to an opened position where the tray plane is essentially parallel with the surface. There is the step of moving the flip ladder from the stepladder configuration to the straight configuration which causes the tray to move automatically into the stowed position."]},
{"abstractText": ["A method of manufacturing a filtering screen includes: attaching handle members () to edges of at least one wire cloth (); providing a jig comprising tensioning means (); placing the at least one wire cloth () in the jig and engaging the handle members () with handle member engagement portions () of the tensioning means (). The tensioning means () are operated to drive the handle members () outwardly to tension the wire cloth () in orthogonal directions. The method also includes pressing the tensioned wire cloth () against a screen frame (); bonding the wire cloth () to the screen frame (); and trimming the wire cloth."]},
{"abstractText": ["A method of positioning a shoe member and a keel assembly relative to a housing of a jigsaw is provided. The method may include securing the keel assembly to the housing so that the keel assembly extends from the housing beyond the shoe member. The housing and the keel assembly may be pivoted relative to the shoe member in a manner such that a position of the housing relative to the keel assembly remains unchanged. A portion of the keel assembly may be uncoupled from the housing."]},
{"abstractText": ["A method for a standalone open frame in one example is configured to support a rack-mount electronic component of a predetermined size selected from any of a plurality of predetermined sizes. The standalone open frame is configured to securely engage the rack-mount electronic component through employment of at least one set of rack-mount adapters that is configured for the predetermined size of the rack-mount electronic component."]},
{"abstractText": ["A closure  is provided for retaining fluid pressure within a vessel, and comprises a hub  having an access opening to the vessel, with the hub having a circumferential stop  and one or more recesses  each extending radially outward from an adjacent inner surface  of the hub. A door  is positioned between the stop surface and the vessel, and a latch member  brings the door into sealing engagement with the stop member. One or more lugs  each extend radially outward from an exterior surface of the door, such that a respective lug engages the hub about a respective recess to seal the door to the hub, while the door may be moved to pass through the one or more recesses and out of the hub."]},
{"abstractText": ["A filter assembly with a replaceable filter element and a reusable filter housing, which incorporates a locking mechanism to ensure that the filter system will not be operated without a filter element installed."]},
{"abstractText": ["A window glass, particularly for installation by adhesive bonding in an opening of a vehicle bodywork, comprises a sheet of glass with a profiled bead that is fixed at least to the main surface of the sheet of glass facing toward the interior in the installed state and that rests against at least part of the opening. The use of such a window glass makes it possible, once the window glass has been installed in the bodywork opening, to obtain a visible space less than 5 mm between the opening and the edge face of the window glass."]},
{"abstractText": ["A pre-assembled orthopaedic implant adapted for improved gas sterilization. The implant includes a first component adapted for assembly with a second component such that a mating surface of the first component is in close proximity with a mating surface of the second component. At least one gas conduit associated with the mating surface of the first component facilitates a sterilizing gas to penetrate into and dissipate from the interface defined by the mating surfaces."]},
{"abstractText": ["An object connector is described to include at least one arm and at least one slot. The arm of the object connector includes a channel for gripping an object. The slot of the object connector includes at least one undulating side designed to receive another object connector. The object connector can include more than one arm or more than one slot. The object connector described herein can be used with both common household objects and specially designed objects to build desired structures or assemblies. The object connector described herein can be made of many different materials depending upon the purpose the object connector is designed for, which includes entertainment, industrial application, household use, etc."]},
{"abstractText": ["A method for connecting at least a first component and a second component together, wherein each said component comprises at least one keyway arrangement extending along the component and keyways of the keyway arrangement are spaced apart from one another. The method comprises the steps of: aligning the keyway arrangements of the first and second components such that the keyways intermesh to provide a continuous keyway passage extending longitudinally between the intermeshed keyways; and, extending a keyway connector comprising an arrangement of keys longitudinally within the continuous keyway passage such that the keys are retained by the keyways of the keyway arrangements. In the slip flange assembly  embodiment shown, the first and second components are each in the form of a pipe () or tube, the keyway arrangements are in the form of collars () that extend around abutting ends of said pipes () or tubes, and the keyway connector () is annular."]},
{"abstractText": ["A fastening system and method of use is disclosed. The fastening system includes a substrate, an aperture and a fastener. The fastener includes flexible wings that allow for insertion of the fastener into an aperture of a vehicle component."]},
{"abstractText": ["A threaded element in the shape of a wire thread insert with a specific geometric design is disclosed. This threaded element contains, in particular, a narrowed helical winding of at least two helical winding sections that enclose one or a plurality of sequential secants. Based on this geometric design of the threaded element, a matched installation process is described."]},
{"abstractText": ["A method of assembling an orthopaedic implant includes positioning a first orthopaedic component in contact with a second orthopaedic component and coupling the first orthopaedic component to the second orthopaedic component with a bolt. The method also includes applying an empirically-determined starting torque to the bolt such that the first orthopaedic component is coupled to the second orthopaedic component with a first predetermined clamp load. The bolt is then rotated by an empirically-determined rotation angle such that the first orthopaedic component is coupled to the second orthopaedic component with a second predetermined clamp load."]},
{"abstractText": ["A fabricating process for a multi-layer printed circuit board containing embedded passive components is provided. The method includes a calibration step wherein a calibration measurement is taken of the geometry or at least one electrical parameter of an arrangement of calibration test points for a circuit forming process, such as masking, etching and/or lamination. A process control step is performed during the process, wherein a process control measurement is taken of at least one electrical parameter at one or more process control test points along one or more axes outside areas in which a circuit is to be formed. An analysis is performed of at least the calibration measurement and the process control measurement to calculate a CAD geometry change required to improve precision of embedded passive components to be printed on the multi-layer printed circuit board. The CAD geometry is modified in accordance with the calculated CAD geometry change, and multi-layer printed circuit boards containing embedded passive components are manufactured in accordance with the modified CAD geometry. The analyzing step may model variability and adapt to it."]},
{"abstractText": ["Electronic components each having a chip module with module contacts and an antenna having antenna contacts is made by securing a plurality of the chip modules the inner face of a module film strip having an outer periphery projecting past the chip module with the chip modules spaced from one another at a uniform predetermined module spacing. A plurality of the antennas are secured to an inner face of an elongated antenna strip with the antennas spaced from one another by a predetermined antenna spacing. The module strip is longitudinally subdivided into sections each of which is of a length equal to the predetermined module spacing and each of which carries a respective chip module. The module-strip sections are pressed against the antenna strip such that the module contacts of each of the chip modules engage and bear on the antenna contacts of a respective antenna."]},
{"abstractText": ["An alloy resistor and a fabrication method thereof are provided. A fabrication method of an alloy resistor includes: providing an alloy sheet having a plurality of openings spacing apart from each other and going through the alloy sheet and a plurality of alloy resistor units located between any two adjacent openings, wherein each of the alloy resistor units has an insulating cover area and a plurality of electrode ends on both sides of the insulating cover area; forming an insulating layer on a surface of the insulating cover area of the alloy resistor units by an electrodeposition coating process; cutting the alloy along a connecting portion, so as to obtain separated alloy resistor units; and forming a conductive adhesion material on the electrode ends of the alloy resistor units. An alloy resistor having an insulating layer with a smooth surface can be obtained by performing an electrodeposition coating process."]},
{"abstractText": ["A method of manufacturing a printed circuit board having a flow preventing dam, including: applying a dry film resist on a base substrate having a solder pad, and then primarily exposing the dry film resist to light; secondarily exposing the primarily exposed dry film resist formed on a peripheral area of the base substrate to light, thus forming a flow preventing dam; removing the unexposed dry film resist to expose the solder pad, thus forming an opening; printing the opening with a solder paste, and then forming a solder bump through a reflow process; and removing the primarily exposed dry film resist"]},
{"abstractText": ["A method for manufacturing a printed circuit board, including providing a core substrate having an electronic component accommodated in the core substrate; forming a positioning mark on the core substrate; forming an interlayer insulating layer over the core substrate, the positioning mark and the electronic component; forming a via hole opening connecting to the electronic component through the interlayer insulating layer in accordance with the positioning mark on the core substrate; and forming a via hole structure in the via hole opening in the interlayer insulating layer such that the via hole structure is electrically connected to the electronic component."]},
{"abstractText": ["A method for manufacturing an electric wire with a terminal, includes crimping a barrel portion of the terminal onto a core wire constructed of metal wires and creating a crack in a metal oxide layer immediately before the crimping. The metal oxide layer is formed on a metal surface of the core wire. The creating of crack is accomplished by applying a mechanical force to the metal oxide layer."]},
{"abstractText": ["According to the present method, a paste-type electrode of lead-acid battery in which a space in the lower surface side of an electrode is favorably filled with a paste-like active material so that inner ribs of a current collector forming a grid shape does not remain exposed. The current collector is filled with a paste-like active material to obtain an electrode when the current collector passes below a filler including a hopper for containing the paste-like active material. An electrode surface is pressed during transfer of the electrode before the fed paste-like active material is hardened. The pressing step includes: a first pressing step of intensively pressing a first area of the electrode surface located on one side in a width direction that is perpendicular to a transfer direction in which the electrode is transferred and a thickness direction of the electrode; a second pressing step of intensively pressing a second area of the electrode surface located on the other side in the width direction; and a third pressing step of pressing the first and second areas of the electrode surface over the entire width of the electrode. The first to third pressing steps are each performed at least once. The pressing step is terminated by the third pressing step."]},
{"abstractText": ["The disclosure provides a method and system for installing components for an offshore wind turbine assembly independent of cranes and derricks. The components are stored in an offshore structure, such as a Spar. After transporting the offshore structure horizontally to a site, the structure can be uprighted to a vertical orientation. A variable ballast component coupled to a tower of the wind turbine assembly can reciprocally retract the tower into the offshore structure to lower the tower, and extend the tower away from the offshore structure to raise the tower until the full quantity of blades are assembled to a turbine coupled to the tower. When the blades are stored in a peripheral fashion around the tower, the method and system provides for automatic rotational indexing of the tower as the tower and turbine retract and extend, so the turbine is progressively aligned with each blade to be installed."]},
{"abstractText": ["A method of making a combustion turbine component includes forming a metallic body by direct metal fabrication (DMF) to have at least one surface portion defining a first plurality of surface cooling features each having a first dimension and at least one second surface cooling feature on at least one of the first plurality of surface cooling features and having a second dimension less than said first dimension and less than 200 μm. Forming the metallic body by DMF may include forming a plurality of metallic combustion turbine subcomponent greenbodies by DMF and assembling the plurality of metallic combustion turbine subcomponent greenbodies together to form a metallic greenbody assembly. The metallic greenbody assembly may be sintered to thereby form the metallic body."]},
{"abstractText": ["Compression springs, such as helical compression springs, include end portions with selectively contoured inner contact surfaces. The selective contours of the inner contact surfaces may take the form of planar, grooved, concave, or other shaped, non-circular surfaces. In addition, enough of the inner contact surface is contoured to reduce the contact stress and/or stress concentration effects on the adjacent coils when the compression spring is placed under load and the adjacent coil engages or contacts the respective end portion. The selective contouring of the end portions may be accomplished by holding the spring in a holder and moving a cutter relative to the end portion of the spring to remove the desired amount of material from the end portion."]},
{"abstractText": ["A novel razor cartridge is disclosed including at least one erodible label disposed onto at least one exterior surface of at least one razor cartridge component via label transfer technologies (e.g., heat transfer process). The erodible label is comprised substantially of a water soluble polymer (from about 10% to about 100% water soluble polymer by weight of composition), may wear off completely after about 2 to 10 shaves, and may include a plurality of erodible labels each with a different composition. An adhesive layer may be disposed above or below the erodible label. Further, the label may provide functional and/or aesthetic benefits, serve as cues or indicia communicated or obtained to the user before, during or after use of the razor product. In one embodiment, a water droplet label on the lube ring provides moisturization benefits during use and also conveys these benefits to the consumer before use (e.g., lubriciousness)."]},
{"abstractText": ["A Motorized shaving apparatus head and motorized shaving apparatus incorporating the same. In one embodiment, the invention is a shaving apparatus comprising: an elongated handle having a longitudinal axis; a power source; a head coupled to a distal end of the elongated handle, the head having a working surface with a longitudinal width of 40-44 mm and a transverse width of 14-16 mm; the working surface comprising a fixed blade having a cutting edge; a rotary cutter having cutting edges disposed within the head, the cutting edges of the rotary cutter positioned adjacent the cutting edge of the fixed blade so that a user's hairs are sheared between the cutting edge of the fixed blade and the cutting edges of the rotary cutter when the rotary cutter is rotating; and a motor operably coupled to the rotary cutter to rotate the rotary cutter about axis."]},
{"abstractText": ["A device for simultaneously cutting and coloring a craft item which comprises a first cutting blade having a first handle, a set of apertures, an outside inclined surface and an inside planar surface; a second cutting blade having a second handle; a reservoir containing a coloring substance; a coloring-substance-distributor; and at least one connection tube in communication with the set of apertures, the reservoir and the coloring-substance-distributor. The first cutting blade is pivotally mounted relative to the second cutting blade. The reservoir and the coloring-substance-distributor are connected via the connection tube which communicates the coloring substance such that the coloring substance may be deposited on the craft item during a cutting activity. The coloring-substance-distributor is activated via sliding the first cutting blade and the second cutting blade against each other and creating a wicking capillary movement of the coloring substance onto the craft item."]},
{"abstractText": ["A folding knife with retractable pocket clip that moves in an arc between retracted and deployed positions generally within the same pivot plane as a pivotally folding blade and whose movement between retracted and deployed positions is coordinated through direct contact with the blade so that the clip is automatically deployed for use as the blade is pivoted into a storage position and automatically retracted when the blade is pivoted to a position for use. The pocket clip is configured to be uniquely sheltered from snagging hazards and to secure the folding knife to a pocket by means of a unique retentive characteristic resulting from localized tension advantageously generated along the pocket edge and maintained by compression exerted upon the body of the knife as it rests within the pocket."]},
{"abstractText": ["An object of the invention is to achieve the practicable use of a pair of barber scissors having a sliding-cutting function. In the barber scissors configured of blade bodies each including a cutting blade and handle, a gear accommodation hole is formed at a pivotal joint intersection of one blade body; a rack is formed on the inner-surface of the gear accommodation hole; and a guide groove is formed in the outer-surface of the blade body. In the pivotal joint shaft position of the other blade body, a pinion having arc-shaped teeth to engage with the rack is mounted to rotate together with the blade body; a guide member having a projection to fit into the guide grove is disposed striding the outer-surface of the gear accommodation hole; and a nut is screwed and mounted on the pivotal joint screw shaft protruding from a shaft hole of the guide member."]},
{"abstractText": ["A grass-cutting head () comprising a spool () for winding at least one cutting line and a housing () for the cutting line, wherein said housing () comprises a first part () and a second part () coupled to each other so as to allow at least one reciprocal angular movement around the axis (X) of rotation of the grass-cutting head. The housing () presents at least one passage () towards the outside for the cutting line. On the spool () is defined at least one inserting portion () for inserting the cutting line so that to a rotation of the spool corresponds a winding or an unwinding of the line. Means () are furthermore present for winding the cutting line on the spool () and matching means () for matching the angular position of the portion () of insertion on the spool () with said passage towards the outside () of the housing, suitable to facilitate the operations of inserting the cutting line in the spool (). The matching means () for matching the angular position comprise at least one reversible coupling between at least one abutment () associated as with one of said first () and second () part, and a corresponding counter-abutment () associated with the other of said first () and second () part."]},
{"abstractText": ["A hand-held jigsaw includes a saw blade and control element for automating a tracking the saw blade, the hand-held jigsaw, or both along layout lines. A sensor, preferably a camera unit, detects a layout line provided on a work piece."]},
{"abstractText": ["An engraving needle holder is disclosed which mounts an engraving needle to a needle bar when an engraving process is executed for a workpiece by moving the engraving needle upward and downward by making use of drive of the needle bar provided on a sewing machine. The engraving needle holder includes a mounted part which is mountable to a fixing part of a lower end of the needle bar into which a handle of the needle is inserted to be fixed, with the needle being removed, a supporting member located at a lower end side of the mounting part so that a base of the engraving needle is mounted to it so as to be positionally adjustable, and an adjusting mechanism which adjusts a mounting height position of the engraving needle relative to the supporting member."]},
{"abstractText": ["A sewing machine includes a needle bar to which an engraving needle is attached and is capable of executing an engraving process of forming an engraved pattern on a workpiece. The sewing machine further includes a heightwise position adjusting mechanism adjusting a mounting heightwise position of the engraving needle relative to the needle bar, a unit imaging the engraved marks formed on the workpiece by the engraving needle, thereby obtaining an image of each engraved mark, a detection unit extracting a region of each engraved mark from the image to detect a size of each engraved mark, a determination unit comparing the size of each engraved mark with a reference value stored, determining a mounting heightwise position of the engraving needle, and a unit informing of information for adjusting the mounting heightwise position of the engraving needle according to determination made by the determination unit."]},
{"abstractText": ["A bed for a measuring machine constituted by a frame provided with a pair of mutually parallel beams bearing guides for the mobile unit of the machine, and a workpiece table housed between the beams; the workpiece table and the frame are constrained to one another by constraint means that decouple the deformations thereof, and the frame comprises at least one cross-member connected to respective intermediate portions of the beams."]},
{"abstractText": ["The detection method is performed by a characteristic tool () constituting the detection device, incorporating a lateral tab () and a front end edge (), so that when the tool is applied to determine whether a banded sleeve has migrated, it happens that if the same is located correctly, such side tab () is supported by its front seat () on a centered portion () of the free edge of the respective lug () of the hardware ()."]},
{"abstractText": ["An upright hair dryer device includes a base that is adapted to support the hair dryer in a predetermined orientation, such as in an upright orientation. The base is configured to serve as a stable platform for the hair dryer so as to reduce the likelihood of the hair dryer undesirably toppling over."]},
{"abstractText": ["A laundry apparatus comprising a housing having an exterior and defining a recess opening to the exterior and a hanging assembly slidably disposed in the recess. In a stored position the hanging assembly is disposed at least partially in the recess and in a use position the hanging assembly is disposed at least partially exteriorly of the recess."]},
{"abstractText": ["A household appliance () comprises a cabinet () accommodating a drum for loading items to be dried and a drying air circuit for circulating drying air through the drum for drying the items therein. The drying air circuit comprises air heating elements () for heating the drying air fed to the drum, and the cabinet is provided with a worktop () defining a surface () having a plurality of apertures () in fluid communication with an air conveying system () adapted to deliver a flow of air through said apertures. The air conveying system comprises an air duct () thermally coupled to the air heating elements in such a way as to cause heat generated by the air heating elements to heat the air to be delivered through the apertures in the drying surface."]},
{"abstractText": ["A clothes dryer may rely on a hybrid heat source for drying clothes. In some embodiments, the clothes dryer may rely on a combination of electrical energy to power the clothes dryer and hydronic heat to dry clothes. The hydronic heat may, for example, use hot water from an outdoor wood boiler circulated into a hydronic coil. Air passing over the hydronic coil may be warmed and delivered to the clothes dryer. The hybrid heat clothes dryer may reduce energy consumption from about 27 amperes to about 3 amperes."]},
{"abstractText": ["The invention relates to a method and to a device for drying a fibrous web wherein the traveling fibrous web is acted upon by steam and hot, moist air in the region of a preceding drying zone and is then fed to the preceding drying zone of a downstream drying zone comprising a drying cylinder and a hood allocated thereto. Hot air is taken out of the hood allocated to the drying cylinder of the downstream drying zone. To create at least a portion of the steam for the preceding drying zone, condensate and/or fresh water occurring in the drying cylinder of the downstream drying zone is heated by the hot air taken out of the hood by means of a first heat exchanger. Alternatively or additionally for creating at least a portion of the hot, moist air for the preceding drying zone, the hot air taken out of the hood guided through the first heat exchanger is fed to the preceding drying zone."]},
{"abstractText": ["By means of the invention, a method and an apparatus () for the drying of goods, in particular for the convection drying of pastas, which are introduced from a first treatment zone () into a second treatment zone (), are to be improved to the effect that the drying process has a lower energy consumption than conventional dryers and the surroundings of the dryer () are polluted only slightly by waste heat. Furthermore, the dryer () is to be designed in a structurally simple and cost-effective way. This object is achieved by means of a method for the drying of goods, in which the temperature in the first treatment zone () is on average lower than in the second treatment zone (), and in which the energy obtained from the exhaust air of the first and/or the second treatment zone () in at least one heat exchanger () is introduced into the first treatment zone ()."]},
{"abstractText": ["The disclosure relates to lacing systems for tightening a shoe or other article. Some embodiments include a lace guide that includes a lace channel that is disposed below a portion of the shoe such that the lace channel is hidden from view, and an exposed end piece that is positioned on the exterior of the article such that the end piece is visible during use. The end piece can be generally bell-shaped and can provide a curved sliding surface for a lace to slide on when being tightened or loosened."]},
{"abstractText": ["An Achilles tendon stretching device can include manual or automatic mechanisms to allow incremental height changes to an insole placed within a walking boot, orthopedic shoe, or post surgical shoe, in order to allow more even and gradual and/or incremental stretching of the Achilles tendon. The height adjustment mechanisms can include mechanical, pneumatic, and/or hydraulic adjustment mechanisms, as well as manual incremental removal of integrally formed layers of a heel wedge."]},
{"abstractText": ["According to one aspect of the invention, perfect gait shoe includes the shape of the foot wear, the foot wear is divided into front section, mid section and rear section, the front section of the sole interfaces with the mid section at an angle of 45 to 95 degree, mid section interfaces with the rear section at an angle of 85 to 125 degree. The perfect gait shoe also includes a hard under sole with oval to varied shaped pockets filled with highly compressible material in the front section and the rear section of the foot wear; this provides cushioning of the fore foot and hind foot. The rear section of the foot wear also has a very hard sole in the rear end of the under sole, the newly invented perfect gait shoes of the foot wear confirms to the shape of the foot in heel strike, foot flat, heel off and toe off stages of walking, the inventing design of the sole helps in providing adequate cushion to the foot preventing pain and injury to the bones of the fore foot and hind foot, adopts to the shape of the foot in normal walking promotes development of foot, leg, thigh, hip muscles of the body."]},
{"abstractText": ["Footwear including a sole, an upper, and a securement arrangement configured to secure the footwear to the foot of a wearer, where the sole and the upper delimit individual toe portions configured to receive, retain, and allow independent articulation of corresponding individual toes of a foot inserted in the footwear, and where the sole includes contouring and curvature which intimately corresponds to the shape of the foot."]},
{"abstractText": ["The invention provides bicycling shoes having soles containing materials of at least two different material densities configured to provide improved comfort, and fit for a wearer when walking or running in the shoes, while providing enhanced force transfer from the wearer to a bicycle pedal when bicycling in the shoes."]},
{"abstractText": ["A novel removable boot attachment for protecting workboot shanks and soles."]},
{"abstractText": ["In one aspect of the present invention, a method of excavation with pointed cutting elements, comprising the steps of providing a excavating assembly with at least one pointed cutting element, the pointed cutting element comprising a rounded apex that intersects a central axis, the pointed cutting element further has a characteristic of having its highest impact resistance to resultant forces aligned with the central axis; engaging the at least one pointed cutting element against a formation such that the formation applies a resultant force against the pointed cutting element; determining an angle of the resultant force; and modifying at least one excavating parameter to align the resultant force with the pointed cutting element's central axis."]},
{"abstractText": ["The invention relates to an excavating device, comprising a floating device which can be moved in a navigating direction and to which a drag head () is attached which during use is dragged over the bottom () and herein loosens soil, and a suction conduit () which connects to the drag head () and which discharges the loosened soil. The excavating device is provided with a steering device () for moving the drag head () out of the navigating direction. The invention also relates to a method for excavating ground () using the excavating device, and a computer program for performing the method."]},
{"abstractText": ["A system for documenting the growth progression of an infant including an indicator that identifies a date associated with the infant or an age of the infant, and an object, unchangeable in size, comprising an element for removably attaching the indicator to the object."]},
{"abstractText": ["An interactive greeting card operative to move between a first position wherein several interconnected panels are folded into a substantially flat position and a second position wherein the several interconnected panels are unfolded into a three-dimensional pop-up structure. Movement between the first and second positions may also control playback of digital audio, activation of one or more LED lights, or various other special effects. An inner sentiment panel is substantially contained within an outer greeting card body and is revealed when the greeting card is moved from the first to the second position. Various openings on the greeting card panels accommodate movement and visibility of the inner sentiment panel."]}
]